:PROPERTIES:
:ID:       1b1a8cff-1d20-4689-8466-ea88411007d7
:END:
#+title: duality
#+author: Preston Pan
#+html_head: <link rel="stylesheet" type="text/css" href="../style.css" />
#+date: <2023-06-10 Sat>
* Programming Explains Duality
Of course, there is logic in programming, but that is kind of boring. What I am going to explain here is a recursive, binary structure known
as the binary tree. It seems like you can model a lot of things in this way as well; John Conway's surreal numbers are a manifestation of this
phenomenon.
#+begin_src python :exports both :results output
class BinaryTreeNode:
    def __init__(self, value):
        self.left = None
        self.right = None
        self.value = value
    def insert(self, value):
        if value < self.value:
            if self.left is None:
                self.left = BinaryTreeNode(value)
            else:
                self.left.insert(value)
        else:
            if self.right is None:
                self.right = BinaryTreeNode(value)
            else:
                self.right.insert(value)
    def print_node(self, level=1):
        print(f"level {level}: {self.value}")
        if self.left is not None:
            self.left.print_node(level + 1)
        if self.right is not None:
            self.right.print_node(level + 1)
root = BinaryTreeNode(5)
root.insert(3)
root.insert(10)

root.print_node()
#+end_src

#+RESULTS:
: level 1: 5
: level 2: 3
: level 2: 10

Currently, all that this binary tree has is an insert method, but that is all that is needed in order to see the [[id:8f265f93-e5fd-4150-a845-a60ab7063164][recursion]] in the structure.
Each node "height" is self similar, and it works of a dual-mode sorting algorithm. That is, smaller values go on the left side, and bigger
values go on the right side. It is the binary tree model in my view that unites the concept of duality with the concept of recursion. Duality
is self similar at every abstraction level, and the duality is crucial for subdividing processing power in order to break a big task
into small tasks, which is needed for recursion to be finite.
